
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * module.et-acas-mgmt-api.azurerm_api_management_product_api.link_to_product[0]
  * module.mdl-et-acas-policy.azurerm_api_management_api_policy.api_policy
* Update
  * azurerm_key_vault_secret.et_acas_subscription_key
* Replace
  * azurerm_api_management_subscription.et_acas_subscription
  * azurerm_api_management_user.et_api_management_user


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.et_acas_subscription must be replaced
-/+ resource "azurerm_api_management_subscription" "et_acas_subscription" {
      ~ allow_tracing       = false -> true
      ~ id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/6d3fecbd-0e37-48b9-bbda-c2c4664b3871" -> (known after apply)
      ~ primary_key         = (sensitive value)
      ~ secondary_key       = (sensitive value)
      ~ subscription_id     = "6d3fecbd-0e37-48b9-bbda-c2c4664b3871" -> (known after apply)
      ~ user_id             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/users/5931a75ae4bbd512288c888c" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # azurerm_api_management_user.et_api_management_user must be replaced
-/+ resource "azurerm_api_management_user" "et_api_management_user" {
      ~ email               = "Peter.Moores@hmcts.net" -> "Harpreet.Jhita@justice.gov.uk"
      ~ first_name          = "Peter" -> "Harpreet"
      ~ id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/users/5931a75ae4bbd512288c888c" -> (known after apply)
      ~ last_name           = "Moores" -> "Jhita"
      ~ state               = "active" -> (known after apply)
      ~ user_id             = "5931a75ae4bbd512288c888c" -> "5931a75ae4bbd512288c480c" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.et_acas_subscription_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "et_acas_subscription_key" {
        id                      = "https://et-sya-api-prod.vault.azure.net/secrets/etacas-subscription-key/d63b2df04a194f05af8a9d1c97eb5a51"
        name                    = "etacas-subscription-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.et-acas-mgmt-api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "et-acas-api"
      + id                  = (known after apply)
      + product_id          = "et-acas"
      + resource_group_name = "cft-prod-network-rg"
    }

  # module.mdl-et-acas-policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "et-acas-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <!-- generate totp -->
                    <set-variable name="client_id" value="et-cos-prod" />
                    <set-variable name="client_secret" value="6JHHG2O4HWONILGW" />
                    <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ234567";
                            var bits = "6JHHG2O4HWONILGW".ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                    var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                    var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                    var timeIndex = unixTimestamp / 30;
                    byte[] challenge = BitConverter.GetBytes(timeIndex);
                    if (BitConverter.IsLittleEndian) {
                    Array.Reverse(challenge);
                    }
            
                    HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                    byte[] hash = hmac.ComputeHash(challenge);
                    int offset = hash[19] & 0xf;
                    int truncatedHash = hash[offset] & 0x7f;
                    for (int i = 1; i < 4; i++)
                    {
                    truncatedHash <<= 8;
                    truncatedHash |= hash[offset + i] & 0xff;
                    }
                    truncatedHash %= 1000000;
                    return truncatedHash.ToString("D6");
                    }"/>
                    <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                        <set-url>http://rpe-service-auth-provider-prod.service.core-compute-prod.internal/lease</set-url>
                        <set-method>POST</set-method>
                        <set-header name="Content-Type" exists-action="override">
                            <value>application/json</value>
                        </set-header>
                        <set-body>@{
                            return new JObject(
                            new JProperty("microservice", (string)context.Variables["client_id"]),
                            new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                            ).ToString();
                            }</set-body>
                    </send-request>
            
                    <set-header name="ServiceAuthorization" exists-action="override">
                        <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As<string>())</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

Plan: 4 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1242,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->